In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/attendance.csv', index_col = 0)

In [3]:
df

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2010  11402  12873     NaN  3870   705
2011  13055  10709  1774.0  3955  1445
2012  13747   7157     NaN  4537  1150
2013  11373   7656     NaN  4092  1237
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097

In [6]:
# 결측값이 있는 부분만 True
# df.isnull()

In [5]:
# 결측값의 개수를 보여줌
df.isnull().sum()

야구      0
축구      0
배구      3
남자농구    0
여자농구    0
dtype: int64

In [9]:
# NaN이 들어간 인덱스를 지운 새로운 데이터프레임을 만듬(즉, 원본 수정 안됨)
df.dropna()
#df.dropna(inplace=True) # 원본 데이터도 변경

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2011  13055  10709  1774.0  3955  1445
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097

In [17]:
# NaN이 들어간 컬럼을 지운 새로운 데이터프레임을 만듬
df.dropna(axis='columns')

         야구     축구  남자농구  여자농구
연도
2008  10881  11642  4208  1329
2009  11562  10983  4152  1206
2010  11402  12873  3870   705
2011  13055  10709  3955  1445
2012  13747   7157  4537  1150
2013  11373   7656  4092  1237
2014  11429   8115  4458  1417
2015  10357   7720  3953  1480
2016  11583   7854  3543  1425
2017  11668   6502  3188  1097

In [18]:
# 결측값을 ()안의 값으로 대체
df.fillna(0)

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2010  11402  12873     0.0  3870   705
2011  13055  10709  1774.0  3955  1445
2012  13747   7157     0.0  4537  1150
2013  11373   7656     0.0  4092  1237
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097

In [21]:
# 결측값을 평균으로 대체
df.fillna(df.mean())

         야구     축구           배구  남자농구  여자농구
연도
2008  10881  11642  1253.000000  4208  1329
2009  11562  10983  1471.000000  4152  1206
2010  11402  12873  1933.857143  3870   705
2011  13055  10709  1774.000000  3955  1445
2012  13747   7157  1933.857143  4537  1150
2013  11373   7656  1933.857143  4092  1237
2014  11429   8115  1967.000000  4458  1417
2015  10357   7720  2311.000000  3953  1480
2016  11583   7854  2336.000000  3543  1425
2017  11668   6502  2425.000000  3188  1097

In [23]:
# 결측값을 중간값으로 대체
df.fillna(df.median())
# df.fillna(df.median(), inplace=True) 원본에 반영한다

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2010  11402  12873  1967.0  3870   705
2011  13055  10709  1774.0  3955  1445
2012  13747   7157  1967.0  4537  1150
2013  11373   7656  1967.0  4092  1237
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097